In [1]:
import pandas as pd

In [2]:
dataset=pd.read_csv("hacker_news.csv")

In [3]:
dataset.head(3)

,id,title,url,num_points,num_comments,author,created_at
0,12224879,Interactive Dynamic Video,http://www.interactivedynamicvideo.com/,386,52,ne0phyte,8/4/2016 11:52
1,11964716,Florida DJs May Face Felony for April Fools' W...,http://www.thewire.com/entertainment/2013/04/f...,2,1,vezycash,6/23/2016 22:20
2,11919867,Technology ventures: From Idea to Enterprise,https://www.amazon.com/Technology-Ventures-Ent...,3,1,hswarna,6/17/2016 0:01

In [4]:
dataset_created_at=pd.to_datetime(dataset.created_at)

In [5]:
dataset["hour"]=dataset_created_at.dt.hour

In [6]:
dataset["hour"].head(3)

0    11
1    22
2     0
Name: hour, dtype: int64

In [23]:
Ask_HN=dataset[dataset.title.str.startswith("Ask HN")]

In [24]:
Show_HN=dataset[dataset.title.str.startswith("Show HN")]

In [25]:
Ask_group=Ask_HN.groupby("hour")["num_comments"].mean().sort_values(ascending=False)

In [26]:
Ask_group.head(3)

hour
15    38.594828
2     23.810345
20    21.525000
Name: num_comments, dtype: float64

In [27]:
Show_group=Ask_HN.groupby("hour")["num_comments"].mean().sort_values(ascending=False)

In [28]:
Show_group.head(3)

hour
15    38.594828
2     23.810345
20    21.525000
Name: num_comments, dtype: float64

In [29]:
dataset["days"]=dataset_created_at.dt.day_name()

In [30]:
dataset["days"].value_counts()

Wednesday    3328
Thursday     3318
Tuesday      3297
Monday       3084
Friday       2985
Sunday       2062
Saturday     2025
Name: days, dtype: int64

In [15]:
dataset["year"]=dataset_created_at.dt.year

In [16]:
dataset["year"].value_counts()

2016    13956
2015     6143
Name: year, dtype: int64

In [17]:
dataset["Month"]=dataset_created_at.dt.month_name()

In [18]:
dataset["Month"].value_counts()

September    2511
October      1693
January      1693
March        1676
November     1665
April        1615
June         1585
August       1562
December     1551
May          1532
February     1511
July         1505
Name: Month, dtype: int64

In [19]:
dataset.head(3)

,id,title,url,num_points,num_comments,author,created_at,hour,days,year,Month
0,12224879,Interactive Dynamic Video,http://www.interactivedynamicvideo.com/,386,52,ne0phyte,8/4/2016 11:52,11,Thursday,2016,August
1,11964716,Florida DJs May Face Felony for April Fools' W...,http://www.thewire.com/entertainment/2013/04/f...,2,1,vezycash,6/23/2016 22:20,22,Thursday,2016,June
2,11919867,Technology ventures: From Idea to Enterprise,https://www.amazon.com/Technology-Ventures-Ent...,3,1,hswarna,6/17/2016 0:01,0,Friday,2016,June

In [31]:
Ask_HN.head(3)

,id,title,url,num_points,num_comments,author,created_at,hour,days,year,Month
6,12296411,Ask HN: How to improve my personal website?,NaN,2,6,ahmedbaracat,8/16/2016 9:55,9,Tuesday,2016,August
16,10610020,Ask HN: Am I the only one outraged by Twitter ...,NaN,28,29,tkfx,11/22/2015 13:43,13,Sunday,2015,November
21,11610310,Ask HN: Aby recent changes to CSS that broke m...,NaN,1,1,polskibus,5/2/2016 10:14,10,Monday,2016,May

In [32]:
Show_HN.head(3)

,id,title,url,num_points,num_comments,author,created_at,hour,days,year,Month
12,10627194,Show HN: Wio Link ESP8266 Based Web of Things...,https://iot.seeed.cc,26,22,kfihihc,11/25/2015 14:03,14,Wednesday,2015,November
38,10646440,Show HN: Something pointless I made,http://dn.ht/picklecat/,747,102,dhotson,11/29/2015 22:46,22,Sunday,2015,November
45,11590768,"Show HN: Shanhu.io, a programming playground p...",https://shanhu.io,1,1,h8liu,4/28/2016 18:05,18,Thursday,2016,April

In [33]:
Ask_HN.pivot_table(index="Month",values="num_comments",columns="year")

year            2015       2016
Month
April            NaN  10.783784
August           NaN  21.745223
December    9.121951        NaN
February         NaN   7.520000
January          NaN  13.612500
July             NaN  11.892086
June             NaN  16.242424
March            NaN  18.566434
May              NaN  18.156028
November   12.553030        NaN
October     8.642857        NaN
September   7.571429  22.152000

In [34]:
Show_HN.pivot_table(index="Month",values="num_comments",columns="year")

year            2015       2016
Month
April            NaN  11.526316
August           NaN  11.989691
December    6.833333        NaN
February         NaN  10.306931
January          NaN  11.030303
July             NaN   7.549451
June             NaN  11.890411
March            NaN   9.992188
May              NaN  15.364865
November    7.892157        NaN
October     9.762887        NaN
September  10.212500  11.415385

In [36]:
ask_2015=Ask_HN.groupby("year").get_group(2015).groupby("Month")["num_comments"].mean()

In [39]:
ask_2016=Ask_HN.groupby("year").get_group(2016).groupby("Month")["num_comments"].mean()

In [40]:
show_2015=Show_HN.groupby("year").get_group(2015).groupby("Month")["num_comments"].mean()

In [45]:
show_2016=Show_HN.groupby("year").get_group(2016).groupby("Month")["num_comments"].mean()

In [46]:
ask_2015=pd.DataFrame(ask_2015)
ask_2016=pd.DataFrame(ask_2016)

In [47]:
show_2015=pd.DataFrame(show_2015)
show_2016=pd.DataFrame(show_2016)

In [48]:
ask_2015

           num_comments
Month
December       9.121951
November      12.553030
October        8.642857
September      7.571429

In [49]:
ask_2016

           num_comments
Month
April         10.783784
August        21.745223
February       7.520000
January       13.612500
July          11.892086
June          16.242424
March         18.566434
May           18.156028
September     22.152000

In [56]:
df = pd.merge(ask_2015, ask_2016, how = "outer", left_index = True, right_index=True, suffixes=(" 2015", " 2016"))
da = pd.merge(show_2015, show_2016, how = "outer", left_index = True, right_index=True, suffixes=(" 2015", " 2016"))

In [59]:
df = df.loc[["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", \
        "November", "December"]]

In [60]:
da = da.loc[["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", \
        "November", "December"]]

In [63]:
df["total"] = df.sum(axis = 1)

In [64]:
da["total"] = da.sum(axis = 1)

In [65]:
df

           num_comments 2015  num_comments 2016      total
Month
January                  NaN          13.612500  13.612500
February                 NaN           7.520000   7.520000
March                    NaN          18.566434  18.566434
April                    NaN          10.783784  10.783784
May                      NaN          18.156028  18.156028
June                     NaN          16.242424  16.242424
July                     NaN          11.892086  11.892086
August                   NaN          21.745223  21.745223
September           7.571429          22.152000  29.723429
October             8.642857                NaN   8.642857
November           12.553030                NaN  12.553030
December            9.121951                NaN   9.121951

In [66]:
da

           num_comments 2015  num_comments 2016      total
Month
January                  NaN          11.030303  11.030303
February                 NaN          10.306931  10.306931
March                    NaN           9.992188   9.992188
April                    NaN          11.526316  11.526316
May                      NaN          15.364865  15.364865
June                     NaN          11.890411  11.890411
July                     NaN           7.549451   7.549451
August                   NaN          11.989691  11.989691
September          10.212500          11.415385  21.627885
October             9.762887                NaN   9.762887
November            7.892157                NaN   7.892157
December            6.833333                NaN   6.833333